Tekla.Structures.Internal.RemotingProxyHelper
Helper class for remoting proxies that serve activated client type objects as singleton instances.

Tekla.Structures.Internal.RemotingProxyHelper.IsTsProcess
Checks TS process
Returns: TS process or not

Tekla.Structures.Internal.RemotingProxyHelper.CreateNewInstance``2(System.String)
Creates an instance of object that is either local or remote based on the current context.
channelName:
The remoting channel name.

Tekla.Structures.Internal.RemotingProxyHelper.DisposeService
Dispose Remoting services